-- Fill Bank table with the values
insert into bank(name, bik) values
    ('Сбербанк','044525225'),
    ('ВТБ','044525187'),
    ('Газпромбанк','044525823'),
    ('Альфа-Банк','044525593'),
    ('Россельхозбанк','045004740'),
    ('Райффайзенбанк','044525700');

-- Fill Organizational_legal_form table with the values
insert into organizational_legal_form(name) values
    ('ООО'),
    ('ЗАО'),
    ('ОАО'),
    ('ИП'),
    ('АО'),
    ('НКО');

-- Fill Client table with the values
insert into client(name, short_name, address, organizational_legal_form_id) values
    ('Рога и Копыта','Рога','Россия, Москва, 117312, ул. Тверская, д. 10', 1),
    ('Технострой','Техно','Россия, Екатеринбург, 620014, ул. Гагарина, д. 15', 1),
    ('СтройИнвест','СтройИнвест','Россия, Казань, 420111, ул. Крупская, д. 30', 2),
    ('ЭнергоПром','ЭнергоПром','Россия, Екатеринбург, 620014, ул. Ленина, д. 20', 3),
    ('Сибирский Нефтегаз','СибНефтегаз','Россия, Новосибирск, 630000, ул. Красный проспект, д. 5', 3),
    ('Иванов Иван Иванович','Иванов Иван Иванович','Россия, Москва, 117312, ул. Вавилова, д. 19', 4),
    ('НефтеГазИнвест АО','НефтеГазИнвест АО','Россия, Москва, 117105, ул. Ленинская Слобода, д. 19', 5),
    ('ПрогрессСтрой','ПрогрессСтрой','Россия, Казань, 420012, просп. Габдуллы Тукая, д. 20', 5);

-- Fill Deposit table with the values
insert into deposit(client_id, bank_id, opening_date, interest_rate, term_months)  values
    (8, 1, '2023-05-15', 4.5, 12),
    (9, 1, '2023-07-20', 3.75, 24),
    (10, 3, '2023-09-10', 5.25, 36),
    (10, 4, '2023-09-10', 5.25, 36),
    (11, 4, '2024-01-05', 4.0, 12),
    (12, 5, '2024-03-08', 3.25, 24),
    (13, 6, '2024-04-10', 5.5, 36);